.data # τμήμα δεδομένων
str: .asciiz "Hello world\n"
number: .word 256
.text # τμήμα κώδικα
.globl main
main:
li $v0, 4 # κωδικός 4 για να εμφανιστεί το str
la $a0, str # φόρτωσε τη διεύθυνση του str στον καταχωρητή $a0
syscall # κλήση συστήματος
# οι επόμενες 4 εντολές προσθέτουν τον αριθμό 8 στη λέξη που ορίζεται στη
# διεύθυνση number και αποθηκεύουν το αποτέλεσμα στην ίδια διεύθυνση
la $t0,number
lw $s1,0($t0)
addi $t2,$s1,8
sw $t2,0($t0)
li $v0, 10 # κωδικός 10 για τερματισμό του προγράμματος
syscall # κλήση συστήματος
